In [1]:
import pandas as pd

In [2]:
from functions import read_data, clean_data, change_value, change_name_country_education, change_name_country_unemployment, drop_columns_education, drop_columns_unemployment

In [3]:
url = "data/edat_lfs_9903__custom_12827842_linear.csv"
education = read_data(url)
pd.set_option('display.max_columns', None)

In [4]:
education = clean_data(education)
drop_columns_education(education)

,sex,isced11,age,geo,time_period,obs_value
0,F:Females,"ED0-2:Less than primary, primary and lower sec...",Y15-29:From 15 to 29 years,AT:Austria,2014,27.9
1,F:Females,"ED0-2:Less than primary, primary and lower sec...",Y15-29:From 15 to 29 years,AT:Austria,2015,27.5
2,F:Females,"ED0-2:Less than primary, primary and lower sec...",Y15-29:From 15 to 29 years,AT:Austria,2016,27.3
3,F:Females,"ED0-2:Less than primary, primary and lower sec...",Y15-29:From 15 to 29 years,AT:Austria,2017,27.2
4,F:Females,"ED0-2:Less than primary, primary and lower sec...",Y15-29:From 15 to 29 years,AT:Austria,2018,27.1
...,...,...,...,...,...,...
6529,T:Total,ED5-8:Tertiary education (levels 5-8),Y15-29:From 15 to 29 years,UK:United Kingdom,2015,28.9
6530,T:Total,ED5-8:Tertiary education (levels 5-8),Y15-29:From 15 to 29 years,UK:United Kingdom,2016,29.3
6531,T:Total,ED5-8:Tertiary education (levels 5-8),Y15-29:From 15 to 29 years,UK:United Kingdom,2017,29.5
6532,T:Total,ED5-8:Tertiary education (levels 5-8),Y15-29:From 15 to 29 years,UK:United Kingdom,2018,30.4
6533,T:Total,ED5-8:Tertiary education (levels 5-8),Y15-29:From 15 to 29 years,UK:United Kingdom,2019,31.1

In [5]:
education = change_value(education)  #cambia los valores de sex
education = change_name_country_education(education)  #cambia los valores de geo
education.head()

,sex,isced11,age,geo,time_period,obs_value
0,Females,"ED0-2:Less than primary, primary and lower sec...",Y15-29:From 15 to 29 years,Austria,2014,27.9
1,Females,"ED0-2:Less than primary, primary and lower sec...",Y15-29:From 15 to 29 years,Austria,2015,27.5
2,Females,"ED0-2:Less than primary, primary and lower sec...",Y15-29:From 15 to 29 years,Austria,2016,27.3
3,Females,"ED0-2:Less than primary, primary and lower sec...",Y15-29:From 15 to 29 years,Austria,2017,27.2
4,Females,"ED0-2:Less than primary, primary and lower sec...",Y15-29:From 15 to 29 years,Austria,2018,27.1

In [6]:
url2 = "data/yth_empl_090__custom_12832588_linear.csv"
unemployment = read_data(url2)

In [7]:
unemployment = clean_data(unemployment)
drop_columns_unemployment(unemployment)
unemployment

      sex     age isced11 geo  time_period  obs_value
0       F  Y15-29   ED0-2  AT         2014       15.7
1       F  Y15-29   ED0-2  AT         2015       15.3
2       F  Y15-29   ED0-2  AT         2016       17.1
3       F  Y15-29   ED0-2  AT         2017       16.8
4       F  Y15-29   ED0-2  AT         2018       13.4
...    ..     ...     ...  ..          ...        ...
13729   T  Y15-29   TOTAL  UK         2015      882.1
13730   T  Y15-29   TOTAL  UK         2016      769.5
13731   T  Y15-29   TOTAL  UK         2017      688.1
13732   T  Y15-29   TOTAL  UK         2018      649.3
13733   T  Y15-29   TOTAL  UK         2019      609.3

[13734 rows x 6 columns]

In [8]:
unemployment = change_value(unemployment)
unemployment = change_name_country_unemployment(unemployment)
unemployment.head()

       sex     age isced11      geo  time_period  obs_value
0  Females  Y15-29   ED0-2  Austria         2014       15.7
1  Females  Y15-29   ED0-2  Austria         2015       15.3
2  Females  Y15-29   ED0-2  Austria         2016       17.1
3  Females  Y15-29   ED0-2  Austria         2017       16.8
4  Females  Y15-29   ED0-2  Austria         2018       13.4